Обработки/Reports/_ОтчетностьСбербанка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОтчетностьСбербанка</Name>
			<Comment>Ранее "Сбербанк и Электроэнергетика"</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОтчетностьСбербанка/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");

	Параметры.Свойство("НастройкиОтчета", ЭтаФорма.НастройкиОтчета);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ПроверитьСоответствиеОрганизацииИСчетаДоверительногоУправления(Отчет.Организация, Отчет.СчетДоверительногоУправления) Тогда	
		Отчет.СчетДоверительногоУправления = Неопределено;
	КонецЕсли;
	
	ПроверитьНастройкиПодписантов();	
	
	ОбновитьПодсказкиЭлементовУправления();

КонецПроцедуры

#Область События_элементов_управления

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ПриИзмененииПараметровШапки();	
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	ПриИзмененииПараметровШапки(Элемент);	
	
	ПроверитьНастройкиПодписантов(Ложь, Истина);
	
	ОбновитьПодсказкиЭлементовУправления();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантРуководительПриИзменении(Элемент)

	ПодписантПриИзменении(ПодписантРуководитель, ПодписантРуководительДолжность, "СтруктураДанныхПодписантаРуководителя", Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ПодписантРуководительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПодписантНачалоВыбора(ПодписантРуководитель, Отчет.Организация, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантРуководительОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ПодписантОбработкаВыбора("СтруктураДанныхПодписантаРуководителя", ПодписантРуководительДолжность, Отчет.Организация, Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

КонецПроцедуры

&НаКлиенте
Процедура ПодписантБухгалтерПриИзменении(Элемент)

	ПодписантПриИзменении(ПодписантБухгалтер, ПодписантБухгалтерДолжность, "СтруктураДанныхПодписантаБухгалтера", Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ПодписантБухгалтерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПодписантНачалоВыбора(ПодписантБухгалтер, Отчет.Организация, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантБухгалтерОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ПодписантОбработкаВыбора("СтруктураДанныхПодписантаБухгалтера", ПодписантБухгалтерДолжность, Отчет.Организация, Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

КонецПроцедуры

&НаКлиенте
Процедура ПодписантИсполнительПриИзменении(Элемент)

	ПодписантПриИзменении(ПодписантИсполнитель, , "СтруктураДанныхПодписантаИсполнителя", Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ПодписантИсполнительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПодписантНачалоВыбора(ПодписантИсполнитель, Отчет.Организация, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантИсполнительОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ПодписантОбработкаВыбора("СтруктураДанныхПодписантаИсполнителя", Неопределено, Отчет.Организация, Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

КонецПроцедуры

&НаКлиенте
Процедура ПодписантКлиентРуководительПриИзменении(Элемент)

	ПодписантПриИзменении(ПодписантКлиентРуководитель, ПодписантКлиентРуководительДолжность, "СтруктураДанныхПодписантаКлиентаРуководителя", Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ПодписантКлиентРуководительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПодписантНачалоВыбора(ПодписантКлиентРуководитель, Отчет.СчетДоверительногоУправления, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантКлиентРуководительОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ПодписантОбработкаВыбора("СтруктураДанныхПодписантаКлиентаРуководителя", ПодписантКлиентРуководительДолжность, Отчет.СчетДоверительногоУправления, Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

КонецПроцедуры

&НаКлиенте
Процедура ПодписантКлиентБухгалтерПриИзменении(Элемент)

	ПодписантПриИзменении(ПодписантКлиентБухгалтер, ПодписантКлиентБухгалтерДолжность, "СтруктураДанныхПодписантаКлиентаБухгалтера", Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ПодписантКлиентБухгалтерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПодписантНачалоВыбора(ПодписантКлиентБухгалтер, Отчет.СчетДоверительногоУправления, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантКлиентБухгалтерОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ПодписантОбработкаВыбора("СтруктураДанныхПодписантаКлиентаБухгалтера", ПодписантКлиентБухгалтерДолжность, Отчет.СчетДоверительногоУправления, Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

КонецПроцедуры

#КонецОбласти

#Область Работа_с_подписантами

&НаКлиенте
Процедура ПодписантНачалоВыбора(Подписант, Организация, Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыКонтактногоЛица = Новый Структура("Организация, КонтактноеЛицо", Организация, Подписант);
	Если ТипЗнч(Организация) = Тип("СправочникСсылка.СчетаДоверительногоУправления") Тогда
		ПараметрыКонтактногоЛица.Вставить("Объект", КлиентДоверительногоУправления(Организация));		
	КонецЕсли;
	
	Параметрыформы = РаботаСОтчетами.ПолучитьПараметрыФормыВыбораКонтактногоЛица(ПараметрыКонтактногоЛица);
	
	ОткрытьФормуМодально("РегистрСведений.КонтактныеЛица.ФормаСписка", ПараметрыФормы, Элемент, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантОбработкаВыбора(ИмяСтруктурыПодписанта, ДолжностьПодписанта, Организация, Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	СтруктураДанныхКонтактногоЛица = Неопределено;	
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ЮрФизЛица") Тогда
		СтруктураДанныхКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛица(ВыбранноеЗначение, Организация);
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("РегистрСведенийКлючЗаписи.КонтактныеЛица") Тогда
		СтруктураДанныхКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(ВыбранноеЗначение);
	КонецЕсли;	
		
	Если Не РаботаСОтчетамиКлиентСервер.ПроверитьСтруктуруДанныхКонтактногоЛица(СтруктураДанныхКонтактногоЛица) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выбрано некорректное значение!");
		ВыбранноеЗначение = Неопределено;
		Возврат;
	КонецЕсли;
	
	ВыбранноеЗначение	= СтруктураДанныхКонтактногоЛица.КонтактноеЛицо;
	ДолжностьПодписанта	= СтруктураДанныхКонтактногоЛица.Должность;
	
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить(ИмяСтруктурыПодписанта, СтруктураДанныхКонтактногоЛица);
	
	ОбновитьПодсказкиЭлементовУправления();

КонецПроцедуры

&НаКлиенте
Процедура ПодписантПриИзменении(Подписант, ДолжностьПодписанта, ИмяСтруктурыПодписанта, Элемент)

	Если Не ЗначениеЗаполнено(Подписант) Тогда
		
		Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить(ИмяСтруктурыПодписанта, Неопределено);
		
		ДолжностьПодписанта = Неопределено;
		
		ОбновитьПодсказкиЭлементовУправления();
		
	КонецЕсли;
	
	ПриИзмененииПараметровШапки();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КлиентДоверительногоУправления(СчетДоверительногоУправления)
	
	Возврат Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(СчетДоверительногоУправления);
	
КонецФункции

&НаКлиенте
Процедура ПроверитьНастройкиПодписантов(ПодписантыУК = Истина, ПодписантыКлиента = Истина)
	
	ДополнительныеСвойства = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства;	
	
	Если ПодписантыУК Тогда	
		
		// Руководитель	
		
		Если Не ДополнительныеСвойства.Свойство("СтруктураДанныхПодписантаРуководителя") Тогда
			ДополнительныеСвойства.Вставить("СтруктураДанныхПодписантаРуководителя", Неопределено);
		КонецЕсли;
		
		Если Не РаботаСОтчетамиКлиентСервер.ПроверитьНастройкиПодписанта(ПодписантРуководитель, ДополнительныеСвойства.СтруктураДанныхПодписантаРуководителя, Отчет.Организация)
			ИЛИ Не ЗначениеЗаполнено(ПодписантРуководитель) 	
		Тогда
			ПодписантРуководительДолжность = Неопределено;
		КонецЕсли;	
		
		// Бухгалтер	
		
		Если Не ДополнительныеСвойства.Свойство("СтруктураДанныхПодписантаБухгалтера") Тогда
			ДополнительныеСвойства.Вставить("СтруктураДанныхПодписантаБухгалтера", Неопределено);
		КонецЕсли;
		
		Если Не РаботаСОтчетамиКлиентСервер.ПроверитьНастройкиПодписанта(ПодписантБухгалтер, ДополнительныеСвойства.СтруктураДанныхПодписантаБухгалтера, Отчет.Организация)
			ИЛИ Не ЗначениеЗаполнено(ПодписантБухгалтер) 	
		Тогда
			ПодписантБухгалтерДолжность = Неопределено;
		КонецЕсли;	

		// Исполнитель	
		
		Если Не ДополнительныеСвойства.Свойство("СтруктураДанныхПодписантаИсполнителя") Тогда
			ДополнительныеСвойства.Вставить("СтруктураДанныхПодписантаИсполнителя", Неопределено);
		КонецЕсли;
		
		РаботаСОтчетамиКлиентСервер.ПроверитьНастройкиПодписанта(ПодписантИсполнитель, ДополнительныеСвойства.СтруктураДанныхПодписантаИсполнителя, Отчет.Организация);
		
	КонецЕсли;		
	
	Если ПодписантыКлиента Тогда	
	
		Клиент = КлиентДоверительногоУправления(Отчет.СчетДоверительногоУправления);	
		
		// Руководитель клиента	
		
		Если Не ДополнительныеСвойства.Свойство("СтруктураДанныхПодписантаКлиентаРуководителя") Тогда
			ДополнительныеСвойства.Вставить("СтруктураДанныхПодписантаКлиентаРуководителя", Неопределено);
		КонецЕсли;
		
		Если Не РаботаСОтчетамиКлиентСервер.ПроверитьНастройкиПодписанта(ПодписантКлиентРуководитель, ДополнительныеСвойства.СтруктураДанныхПодписантаКлиентаРуководителя, Клиент)
			ИЛИ Не ЗначениеЗаполнено(ПодписантКлиентРуководитель) 	
		Тогда
			ПодписантКлиентРуководительДолжность = Неопределено;
		КонецЕсли;
		
		// Бухгалтер клиента	
		
		Если Не ДополнительныеСвойства.Свойство("СтруктураДанныхПодписантаКлиентаБухгалтера") Тогда
			ДополнительныеСвойства.Вставить("СтруктураДанныхПодписантаКлиентаБухгалтера", Неопределено);
		КонецЕсли;
		
		Если Не РаботаСОтчетамиКлиентСервер.ПроверитьНастройкиПодписанта(ПодписантКлиентБухгалтер, ДополнительныеСвойства.СтруктураДанныхПодписантаКлиентаБухгалтера, Клиент)
			ИЛИ Не ЗначениеЗаполнено(ПодписантКлиентБухгалтер) 	
		Тогда
			ПодписантКлиентБухгалтерДолжность = Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПодсказкиЭлементовУправления()

	Элементы.ПодписантРуководитель.Подсказка		= ПодписантРуководительДолжность;
	Элементы.ПодписантБухгалтер.Подсказка			= ПодписантБухгалтерДолжность;
	Элементы.ПодписантКлиентРуководитель.Подсказка	= ПодписантКлиентРуководительДолжность;
	Элементы.ПодписантКлиентБухгалтер.Подсказка		= ПодписантКлиентБухгалтерДолжность;	
	
КонецПроцедуры

#КонецОбласти

#Область Служебные_и_вспомогательные_функции

&НаКлиентеНаСервереБезКонтекста
Функция ПроверитьСоответствиеОрганизацииИСчетаДоверительногоУправления(Организация, СчетДоверительногоУправления)

	Результат = Истина;	
	
	Если ЗначениеЗаполнено(СчетДоверительногоУправления) Тогда
		Результат = (Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СчетДоверительногоУправления, "Организация")); 
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПриИзмененииПараметровШапки(Элемент = Неопределено)
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НЕАКТУАЛЬНОСТЬ");
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПриСменеТекущейОрганизации() Экспорт
	
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	Если Не ПроверитьСоответствиеОрганизацииИСчетаДоверительногоУправления(Отчет.Организация, Отчет.СчетДоверительногоУправления) Тогда	
		Отчет.СчетДоверительногоУправления = Неопределено;
	КонецЕсли;
	
	ПриИзмененииПараметровШапки();	
	
	ПроверитьНастройкиПодписантов();	
	
	ОбновитьПодсказкиЭлементовУправления();	
	
КонецПроцедуры

&НаКлиенте 
Процедура АвтоматическоеФормирование() Экспорт

	// Очищаем настройки формы	
	
	ДополнительныеСвойства = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства;	
	
	ДополнительныеСвойства.Вставить("СтруктураДанныхПодписантаРуководителя",		Неопределено);
	ДополнительныеСвойства.Вставить("СтруктураДанныхПодписантаБухгалтера",			Неопределено);	
	ДополнительныеСвойства.Вставить("СтруктураДанныхПодписантаИсполнителя",			Неопределено);
	ДополнительныеСвойства.Вставить("СтруктураДанныхПодписантаКлиентаРуководителя",	Неопределено);	
	ДополнительныеСвойства.Вставить("СтруктураДанныхПодписантаКлиентаБухгалтера",	Неопределено);
	
	Если РаботаСОтчетамиКлиент.ТребуетсяОткрытьФорму(ЭтаФорма.НастройкиОтчета) Тогда
		ЭтаФорма.ПодписантРуководитель					= Неопределено;
		ЭтаФорма.ПодписантРуководительДолжность			= Неопределено;
		ЭтаФорма.ПодписантБухгалтер						= Неопределено;
		ЭтаФорма.ПодписантБухгалтерДолжность			= Неопределено;
		ЭтаФорма.ПодписантИсполнитель					= Неопределено;
		ЭтаФорма.ПодписантКлиентРуководитель			= Неопределено;
		ЭтаФорма.ПодписантКлиентРуководительДолжность	= Неопределено;
		ЭтаФорма.ПодписантКлиентБухгалтер				= Неопределено;
		ЭтаФорма.ПодписантКлиентБухгалтерДолжность		= Неопределено;
	КонецЕсли;	
	
	// Заполняем настройки отчета	
	
	ЗаполнитьЗначенияСвойств(Отчет, ЭтаФорма.НастройкиОтчета);
	
	Если ЭтаФорма.НастройкиОтчета.Свойство("ПодписантРуководитель") Тогда 	
		СтруктураДанныхПодписантаРуководителя = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛица(ЭтаФорма.НастройкиОтчета.ПодписантРуководитель, Отчет.Организация);
		Если ЗначениеЗаполнено(СтруктураДанныхПодписантаРуководителя) Тогда
			ДополнительныеСвойства.Вставить("СтруктураДанныхПодписантаРуководителя", СтруктураДанныхПодписантаРуководителя);
			ЭтаФорма.ПодписантРуководитель			= СтруктураДанныхПодписантаРуководителя.КонтактноеЛицо;
			ЭтаФорма.ПодписантРуководительДолжность	= СтруктураДанныхПодписантаРуководителя.Должность;
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтаФорма.НастройкиОтчета.Свойство("ПодписантГлавбух") Тогда 	
		СтруктураДанныхПодписантаБухгалтера = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛица(ЭтаФорма.НастройкиОтчета.ПодписантГлавбух, Отчет.Организация);
		Если ЗначениеЗаполнено(СтруктураДанныхПодписантаБухгалтера) Тогда
			ДополнительныеСвойства.Вставить("СтруктураДанныхПодписантаБухгалтера", СтруктураДанныхПодписантаБухгалтера);
			ЭтаФорма.ПодписантБухгалтер				= СтруктураДанныхПодписантаБухгалтера.КонтактноеЛицо;
			ЭтаФорма.ПодписантБухгалтерДолжность	= СтруктураДанныхПодписантаБухгалтера.Должность;
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтаФорма.НастройкиОтчета.Свойство("Подписант") Тогда 	
		СтруктураДанныхПодписантаИсполнителя = ЭтаФорма.НастройкиОтчета.Подписант;
		Если ЗначениеЗаполнено(СтруктураДанныхПодписантаИсполнителя) Тогда
			ДополнительныеСвойства.Вставить("СтруктураДанныхПодписантаИсполнителя", СтруктураДанныхПодписантаИсполнителя);
			ЭтаФорма.ПодписантИсполнитель = СтруктураДанныхПодписантаИсполнителя.КонтактноеЛицо;
		КонецЕсли;
	КонецЕсли;	
	
	Если РаботаСОтчетамиКлиент.ТребуетсяОткрытьФорму(ЭтаФорма.НастройкиОтчета) Тогда
		ОбновитьПодсказкиЭлементовУправления();
	КонецЕсли;
	
	// Формируем и обрабатываем результат
	
	СкомпоноватьРезультат();
	
	РаботаСОтчетамиКлиент.АвтоматическоеФормированиеОтчета(ЭтаФорма, ЭтаФорма.Результат);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ТекстСообщения = "";
	
	Если Не ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(Отчет.Период,,, ТекстСообщения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,, "Отчет.Период", Отказ);	
	КонецЕсли;
	
КонецПроцедуры
